Revit 2027 API
TableCellStyle.BorderBottomLineStyle Property
 The element id (GraphicsStyle element) for the bottom line of the cell border.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId BorderBottomLineStyle { get; set; }
Public Property BorderBottomLineStyle As ElementId
	Get
	Set
public:
property ElementId^ BorderBottomLineStyle {
	ElementId^ get ();
	void set (ElementId^ value);
}
member BorderBottomLineStyle : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
TableCellStyle Class
Autodesk.Revit.DB Namespace